{
  "blogs": [
    {
      "title": "Impact of Covid-19 on Indian economy",
      "body": "The impact of coronavirus pandemic on India has been largely disruptive in terms of economic activity as well as a loss of human lives. Almost all the sectors have been adversely affected as domestic demand and exports sharply plummeted with some notable exceptions where high growth was observed. An attempt is made to analyze the impact and possible solutions for some key sectors.\nFood & Agriculture\n\nSince agriculture is the backbone of the country and a part of the government announced essential category, the impact is likely to be low on both primary agricultural production and usage of agro-inputs. Several state governments have already allowed free movement of fruits, vegetables, milk etc. Online food grocery platforms are heavily impacted due to unclear restrictions on movements and stoppage of logistics vehicles. RBI and Finance Minister announced measures will help the industry and the employees in the short term. Insulating the rural food production areas in the coming weeks will hold a great answer to the macro impact of COVID-19 on Indian food sector as well as larger economy.\n\nAviation & Tourism\n\nThe contribution of the Aviation Sector and Tourism to our GDP stands at about 2.4% and 9.2% respectively. The Tourism sector served approximately 43 million people in FY 18-19. Aviation and Tourism were the first industries that were hit significantly by the pandemic. The common consensus seems to be that COVID will hit these industries harder than 9/11 and the Financial Crisis of 2008. These two industries have been dealing with severe cash flow issues since the start of the pandemic and are staring at a potential 38 million lay-offs, which translates to 70 per cent of the total workforce. The impact is going to fall on both, White and Blue collar jobs. According to IATO estimates, these industries may incur losses of about 85 billion Rupees due to travel restrictions. The Pandemic has also brought about a wave of innovation in the fields of contactless boarding and travel technologies.\n\nTelecom\n\nThere has been a significant amount of changes in the telecom sector of India even before the Covid-19 due to brief price wars between the service providers. Most essential services and sectors have continued to run during the pandemic thanks to the implementation of the ‘work from home’ due to restrictions. With over 1 billion connections as of 2019, the telecom sector contributes about 6.5 per cent of GDP and employs almost 4 million people. Increased broadband usage had a direct impact and resulted in pressure on the network. Demand has been increased by about 10%. However, the Telco’s are bracing for a sharp drop in adding new subscribers. As a policy recommendation, the government can aid the sector by relaxing the regulatory compliances and provide moratorium for spectrum dues, which can be used for network expansions by the companies.",
      "author": "Shadrack",
      "id": 8
    },
    {
      "title": "All You Need to Know About Infrastructure Investment Trusts (InvITs)",
      "body": "Infrastructure Investment Trusts (InvITs) are exchange-traded investments that offer investors partial ownership in infrastructure projects. These trusts are governed by SEBI regulations. InvITs are managed by professionals, relieving investors of project management responsibilities. They provide income through dividends, interest, and capital gains.\n\nIn this blog, we will discuss what InvITs are, how they are formed, their types, how they generate returns, the taxation rules, and if they are a suitable investment for you.\n\nWhat is an Infrastructure Investment Trust (InvIT)?\nInfrastructure Investment Trusts (InvITs) are infrastructure developer-sponsored Trusts that own, operate, and invest in completed and under-construction infrastructure projects. These infrastructure assets include roads and highways, power distribution networks, telecom towers, fiber optic networks, etc.\n\nThe main objective of the InvITs is to facilitate investment in the infrastructure sector in India for overall economic growth. Also, it aims to distribute a significant portion of the income to unit holders as dividends, providing investors with a consistent income stream.\n\nInvITs are similar to mutual funds. Like mutual funds, they pool small amounts from various individuals/institutional investors and invest in infrastructure projects. Also, as the fund managers manage mutual funds, InvITs are also managed by the designated managers.\n\nInvITs are also sometimes confused with REITs (Real Estate Investment Trusts), as many investors believe both are the same. In comparison, the basic structure and operations are similar, but the investing style differs. We will understand this later. \n\nHow is an InvIT Formed?\nHere’s how an InvIT is typically formed:\n\nSponsor: In order to form an InvIT, the first step is to become a sponsor. Any Infrastructure Development Company can take the role of the sponsor. After this sponsor, is required to appoint a Trustee. The sponsor finds a pool of income-generating infrastructure assets.\n\nSetting up an InvIT: The sponsor establishes a trust, often in the form of a special purpose vehicle (SPV), to hold the infrastructure assets. This SPV becomes the InvIT and is registered as a trust under the Indian Trusts Act, 1882.\n\nAppointment of  Trustee: After the sponsor appoints a Trustee, the Trustee takes over control of the assets that will be part of the Infrastructure Investment Trust.\n\nAfter the Trustee assumes control, the Sponsor can no longer control or operate the assets of the InvIT. The Trust now owns these assets and can be controlled directly. \n\nAlternatively, the InvIT may indirectly control the infrastructure assets through a Special Purpose Vehicle (SPV). In this case, the SPV directly controls the infrastructure asset on behalf of the Trust, but the InvIT must maintain at least a 50% stake in such an SPV.",
      "author": "Shadrack",
      "id": 9
    },
    {
      "title": "History of Nifty and Sensex",
      "body": "History of NSE\nThe National Stock Exchange of India Limited (NSE) was established in 1992 and began operations in 1994. It was the first demutualized electronic exchange in India, meaning that it was owned and operated by its members instead of a group of brokers. NSE was founded to bring transparency and efficiency to the Indian capital markets and provide a level playing field for all market participants.\n\nThe introduction of electronic trading by the NSE transformed how people trade securities in India. It also introduced novel products and services, such as derivatives and screen-based trading, making capital markets more accessible to a broader range of participants. In addition, NSE introduced USD-INR pair weekly futures trading and the Transportation & Logistics Index in the recent past.\n\nWhat is NIFTY?\nNIFTY is an index of the National Stock Exchange of India (NSE), one of India’s largest stock exchanges. The NIFTY 50 index measures the performance of 50 of the NSE’s largest and most liquid companies. It is a barometer of the Indian equity market and a benchmark for investment portfolios. The NIFTY 50 is calculated using free float market capitalization weighted methodology, with the index level reflecting the total market value of all stocks in the index relative to a specific base period.\n\nNIFTY’s major indices offered are NIFTY Next 50, NIFTY Auto, and NIFTY IT. Apart from these, NIFTY also offers indices representing other sectors of the Indian economy, such as pharmaceuticals, FMCG, energy, and more.\n\nHistory of BSE\nThe Bombay Stock Exchange (BSE) is the oldest stock exchange in Asia and one of the oldest in the world. BSE began its journey in 1875 under the name of “The Native Share & Stock Brokers’ Association” as a small group of brokers who trade below a banyan tree outside Mumbai’s Town Hall and has since grown to become one of the world’s largest and most influential stock exchanges.\n\nIn the late 1800s, BSE introduced a new trading system known as the “open outcry” system, where traders would gather on a designated trading floor, or “ring,” to buy and sell stocks. This system has been in use for over a century and is still in use today, though electronic trading has largely replaced it.\n\nBSE was the first Indian stock exchange to launch an electronic trading system, BSE On-Line Trading (BOLT), in 1986, which has since been upgraded to a more advanced trading platform. Today, the BSE is one of India’s leading exchanges, with a market capitalization of more than $3.5 trillion.\n\nBSE has also played a vital role in the Indian capital market development, introducing several critical reforms and initiatives over the years. The introduction of the scrip-less trading system, index-based derivative products, and the launch of the mutual fund trading platform are just a few examples.\n\nWhat is SENSEX?\nThe SENSEX is an index of the BSE. It was introduced in 1986 and has since become one of India’s most widely followed equity indices. SENSEX is a barometer of the Indian stock market, representing the performance of 30 of the largest and most liquid companies listed on the BSE.\n\nSome of the major indices by BSE include S&P BSE 150 MidCap, S&P BSE 250 SmallCap, and S&P BSE AllCap. ",
      "author": "Shadrack",
      "id": 10
    },
    {
      "title": "IPO GMP, Latest IPO Grey Market Premium & Kostak Rates",
      "body": "The grey market premium aka IPO GMP is information that is calculated based on the demand of a company that is coming up with an IPO. The grey market starts unofficially in the unregulated market after the IPO date and price band announcements. IPO Investors always look at the Upcoming IPO GMP before investing in IPO but it might vary as per the market conditions, demand, and subscription numbers.\n",
      "author": "Shadrack",
      "id": 11
    },
    {
      "title": "MFIs need to focus on data privacy and cyber security: SBI MD",
      "body": "State Bank of India (SBI) managing director Alok Kumar Choudhary on November 8 said there is a need for micro finance institutions (MFIs) to pay attention to data privacy and cyber security as they deal with data of a large number of customers. Speaking at a conference organised by Sa-Dhan, he said, MFIs should also focus on capacity building to deal with the challenges of the future.\n\n\"The second thing which is very important is the integration with the evolving regulation particularly when you have data privacy law. The enormous amount of data which has been handled by all the MFIs, this particular aspect (data privacy) requires attention and some kind of action plan needs to be in place,\" he said. Financial institutions need to focus on improving ease of transaction through digital means, he said, adding, the need of the customers in the changing time has to be addressed as per their convenience and ease.\n\n\"For this segment of (bottom of the pyramid) customers, we need to understand what they want and ease with which their desire can be fulfilled,\" he said. SBI has a significant credit line to MFIs as well as to NBFCs that are trying to foster financial inclusion.\n\nTalking about participation of SBI in the government's financial inclusion drive, Choudhary said, the bank alone has opened 36 per cent of the total account opened under PM Jan Dhan Yojana. More than 50 crore bank accounts have been opened under the PM Jan Dhan Yojana in the last nine years and the deposit balance swelled to over Rs 2.03 lakh crore.",
      "author": "Shadrack",
      "id": 12
    },
    {
      "title": "Cut cut cut: Indian IT firms slash revenue guidance across the board as growth sputters",
      "body": "Five out of 7 IT companies that have reported their numbers for Q2FY24 have revised their guidance downward for the year in a tough demand environment, leading to sputtering growth.\n\nInfosys, HCLTech, L&T Tech Services and Happiest Minds have all cut their revenue guidance forecasts, and Wipro has guided for degrowth that was lower than anticipated.  LTIMindtree and Tata Consultancy Services do not offer a revenue growth guidance target, but the latter has said that growth this year will be in single digits.\n\nWipro, the latest IT largecap to declare its results for the September quarter, offered a muted revenue growth guidance for the next quarter, lower than what was expected, at -3.5 to -1.5 percent. According to Chief Financial Officer Aparna Iyer, the guidance reflects a weak revenue environment.\n\n“The weak guidance captures (1) higher furloughs, (2) continued weakness in discretionary spending and higher exposure to the same and (3) some revenue leakage due to wallet share loss,” analysts wrote in a Kotak Institutional Equities note. The guidance, it said, indicates the persistence of weak trends, and Wipro is “on a sticky wicket with continued growth underperformance versus peers, senior executive attrition, lack of mega deals and revenue leakage”.",
      "author": "shadrack",
      "id": 13
    }
  ]
}
